Revit 2017 API
StructuralSectionISplitParallelFlange Class
 Defines parameters for I-split Parallel Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionISplitParallelFlange : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionISplitParallelFlange _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionISplitParallelFlange : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
See Also
StructuralSectionISplitParallelFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace